src/cf/Catalogs/узСтатусыЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>узСтатусыЗадачи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узВидыСтатусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидимостьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьЗадачиДляДанногоСтатусаВФормеСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьWIPЛимит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьWIPЛимитНаИсполнителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WIPЛимитУказываетсяВРодителе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WIPЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляКанбанДоски</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/узСтатусыЗадачи/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	Элементы.ГруппаWIPЛимит.Видимость = Ложь;
	Элементы.ГруппаWIPЛимит.ТолькоПросмотр = Истина;
	Элементы.ИспользоватьWIPЛимит.ТолькоПросмотр = Истина;
	Элементы.ДекорацияПояснение.Видимость = Ложь;
	
	Если Объект.ИспользоватьWIPЛимит Тогда
		Элементы.ГруппаWIPЛимит.Видимость = Истина;
	Конецесли;
	
	Если Объект.WIPЛимитУказываетсяВРодителе Тогда
		Элементы.ДекорацияПояснение.Видимость = Истина;
	Иначе
		Элементы.ГруппаWIPЛимит.ТолькоПросмотр = Ложь;
		Элементы.ИспользоватьWIPЛимит.ТолькоПросмотр = Ложь;
	Конецесли;
КонецПроцедуры 

&НаКлиенте
Процедура ИспользоватьWIPЛимитПриИзменении(Элемент)
	Если Объект.ИспользоватьWIPЛимит = Ложь Тогда
		Объект.ИспользоватьWIPЛимитНаИсполнителя = Ложь;
		Объект.WIPЛимитУказываетсяВРодителе = Ложь;
		Объект.WIPЛимит = 0;
	Конецесли;
	
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Справочник_узСтатусыЗадачи_Записан");
КонецПроцедуры
